Tekla.Structures.Internal.ArcTools
Contains method to obtain parameters of an arc.

Tekla.Structures.Internal.ArcTools.GetArcCenterPointUsing3Points(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Gets arc center point using 3 points.
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point on arc.
Returns: Center point.

Tekla.Structures.Internal.ArcTools.GetArcCenterPointFromTangent(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector@)
Gets arc center point from the start point, end point, and a point along the tangent line to the start point
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnTangent: Point along the tangent line to the start point of the arc
arcNormal: Output parameter that will contain the arc normal
Returns: Center point.

Tekla.Structures.Internal.ArcTools.GetArcMiddlePoint(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector)
Gets the arc middle point using the start and end points, given the center and the normal of the arc
startPoint: Start point of the arc
endPoint: End point of the arc
centerPoint: Center of the arc
normal: Normal of the arc. Defines the direction.
Returns: Middle point of the arc

Tekla.Structures.Internal.ArcTools.GetArcNormal(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Computes the arc normal using three points
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point on the arc.
Returns: Arc normal that allows to compute the arc angle correctly

Tekla.Structures.Internal.ArcTools.GetArcAngleBy3Points(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector@)
Gets arc angle in range of 0 to 2PI rad using arc points. Returns the normal that gives that angle when calculating
the angle between start and end.
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point on the arc.
arcNormal: Output arc normal
Returns: Arc angle.

Tekla.Structures.Internal.ArcTools.GetArcAngleBy3Points(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Gets arc angle in range of 0 to 2PI rad using arc points.
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point on the arc.
Returns: Arc angle.

Tekla.Structures.Internal.ArcTools.GetBulgeToWidthRatio(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Calculates the bulge/width ratio of an arc (width is the distance between start and end points)
startPoint: Start point of the arc.
endPoint: End point of the arc.
pointOnArc: Point on the arc.
Returns: Bulge-To-Width ratio

Tekla.Structures.Internal.ArcTools.GetArcMiddlePoint(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Geometry3d.Vector)
Gets an middle point on an arc with the given bulge-to-width-ratio
startPoint: Start point of the arc
endPoint: End point of the arc
bulgeToWidth: Bulge to width ratio
normal: Normal of the arc
Returns: Arc middle point with the given parameters

Tekla.Structures.Internal.ArcTools.AreArcPointsCollinear(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Determines whether three points are collinear
point1: First point
point2: Second point
point3: Third point
Returns: True if the points are collinear, false otherwise